ExprovipFuel/src/Documents/ВводОстатков/ВводОстатков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводОстатков</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоставщики</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыКлиенты</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВзаиморасчетыКлиенты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВзаиморасчетыПоставщики</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ExprovipFuel/src/AccumulationRegisters/ВзаиморасчетыКлиенты/ВзаиморасчетыКлиенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыКлиенты</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаТранзакции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ExprovipFuel/src/AccumulationRegisters/ВзаиморасчетыПоставщики/ВзаиморасчетыПоставщики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыПоставщики</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаТранзакции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ExprovipFuel/src/Documents/ВводОстатков/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)	
	ВзаиморасчетыКлиенты();
	ВзаиморасчетыПоставщики();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВзаиморасчетыКлиенты()
	Движения.ВзаиморасчетыКлиенты.Записывать = Истина;
	Для Каждого ТекСтрокаВзаиморасчетыКлиенты из ВзаиморасчетыКлиенты Цикл
		Движение = Движения.ВзаиморасчетыКлиенты.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Контрагент = ТекСтрокаВзаиморасчетыКлиенты.Контрагент;
		Движение.Валюта = ТекСтрокаВзаиморасчетыКлиенты.Валюта;
		Движение.Сумма = ТекСтрокаВзаиморасчетыКлиенты.Сумма;
		Движение.ДатаТранзакции = Дата;
	КонецЦикла;	
КонецПроцедуры

Процедура ВзаиморасчетыПоставщики()
	Движения.ВзаиморасчетыПоставщики.Записывать = Истина;
	Для Каждого ТекСтрокаВзаиморасчетыПоставщики из ВзаиморасчетыПоставщики Цикл
		Движение = Движения.ВзаиморасчетыПоставщики.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Контрагент = ТекСтрокаВзаиморасчетыПоставщики.Контрагент;
		Движение.Валюта = ТекСтрокаВзаиморасчетыПоставщики.Валюта;
		Движение.Сумма = ТекСтрокаВзаиморасчетыПоставщики.Сумма;
		Движение.ДатаТранзакции = Дата;
	КонецЦикла;	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли
